#pragma once
namespace deFine {
#define _CRT_SECURE_NO_WARNINGS 
#define z 5 // директива препроцесора Ц макровизначенн€
#define SQR(x) (x)*(x) // макрос з параметром Ц визначенн€ квадрата числа
	// макрос визначенн€ найб≥льшого з двох чисел
#define MAX(y,z) ((y)>(z))?(y):(z) // макрос €к умовний вираз
 // виведенн€ пов≥домленн€ та значенн€ ц≥лого числа
#define MIN(y,z) ((y)>(z))?(z):(y) // макрос €к умовний вираз
 // виведенн€ пов≥домленн€ та значенн€ ц≥лого числа
#define MODULE(y) ((0)>(y))?(-y):(y) // макрос €к умовний вираз
 // виведенн€ пов≥домленн€ та значенн€ ц≥лого числа
#define PRINTI(w) puts("control output"); \
 printf(#w"=%d\n",w) 
 // використовуЇтьс€ символ продовженн€ макроса '\'
// символ '#' використовуЇтьс€ дл€ обТЇднанн€ р€дк≥в
 // виведенн€ пов≥домленн€ та значенн€ д≥йсного числа
#define PRINTR(w) puts ("result :"); \
 printf (#w"=%f\n",(float)w)
}